JayHeng/imxrt-tool-flash-algo/devices/MIMXRT685S/arm/startup_MIMXRT685S_cm33.s
;/*****************************************************************************
; * @file:    startup_MIMXRT685S_cm33.s
; * @purpose: CMSIS Cortex-M33 Core Device Startup File for the
; *           MIMXRT685S_cm33
; * @version: 1.0
; * @date:    2018-6-19
; *
; * Copyright 1997-2016 Freescale Semiconductor, Inc.
; * Copyright 2016-2019 NXP
; * All rights reserved.
; *
; * SPDX-License-Identifier: BSD-3-Clause
; *
; *------- <<< Use Configuration Wizard in Context Menu >>> ------------------
; *
; *****************************************************************************/


                PRESERVE8
                THUMB

; Vector Table Mapped to Address 0 at Reset
                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                IMPORT  |Image$$ARM_LIB_STACK$$ZI$$Limit|

__Vectors       DCD     |Image$$ARM_LIB_STACK$$ZI$$Limit| ; Top of Stack
                DCD     Reset_Handler             ; Reset Handler

                DCD     NMI_Handler
                DCD     HardFault_Handler
                DCD     MemManage_Handler
                DCD     BusFault_Handler
                DCD     UsageFault_Handler
__vector_table_0x1c
                DCD     SecureFault_Handler
                DCD     0x180000                  ;Image length
                DCD     0
                DCD     0
                DCD     SVC_Handler
                DCD     DebugMon_Handler
                DCD     __Vectors                 ;Image load address
                DCD     PendSV_Handler
                DCD     SysTick_Handler

                ; External Interrupts
                DCD     WDT0_IRQHandler  ; Windowed watchdog timer 0 (CM33 watchdog)
                DCD     DMA0_IRQHandler  ; DMA controller 0 (secure or CM33 DMA)
                DCD     GPIO_INTA_IRQHandler  ; GPIO interrupt A
                DCD     GPIO_INTB_IRQHandler  ; GPIO interrupt B
                DCD     PIN_INT0_IRQHandler  ; Pin interrupt 0 or pattern match engine slice 0 int
                DCD     PIN_INT1_IRQHandler  ; Pin interrupt 1 or pattern match engine slice 1 int
                DCD     PIN_INT2_IRQHandler  ; Pin interrupt 2 or pattern match engine slice 2 int
                DCD     PIN_INT3_IRQHandler  ; Pin interrupt 3 or pattern match engine slice 3 int
                DCD     UTICK0_IRQHandler  ; Micro-tick Timer
                DCD     MRT0_IRQHandler  ; Multi-Rate Timer
                DCD     CTIMER0_IRQHandler  ; Standard counter/timer CTIMER0
                DCD     CTIMER1_IRQHandler  ; Standard counter/timer CTIMER1
                DCD     SCT0_IRQHandler  ; SCTimer/PWM
                DCD     CTIMER3_IRQHandler  ; Standard counter/timer CTIMER3
                DCD     FLEXCOMM0_IRQHandler  ; Flexcomm Interface 0 (USART, SPI, I2C, I2S)
                DCD     FLEXCOMM1_IRQHandler  ; Flexcomm Interface 1 (USART, SPI, I2C, I2S)
                DCD     FLEXCOMM2_IRQHandler  ; Flexcomm Interface 2 (USART, SPI, I2C, I2S)
                DCD     FLEXCOMM3_IRQHandler  ; Flexcomm Interface 3 (USART, SPI, I2C, I2S)
                DCD     FLEXCOMM4_IRQHandler  ; Flexcomm Interface 4 (USART, SPI, I2C, I2S)
                DCD     FLEXCOMM5_IRQHandler  ; Flexcomm Interface 5 (USART, SPI, I2C, I2S)
                DCD     FLEXCOMM14_IRQHandler  ; Flexcomm Interface 14 (SPI only)
                DCD     FLEXCOMM15_IRQHandler  ; Flexcomm Interface 15 (I2C only)
                DCD     ADC0_IRQHandler  ; ADC0
                DCD     Reserved39_IRQHandler  ; Reserved interrupt
                DCD     ACMP_IRQHandler  ; Analog comparator
                DCD     DMIC0_IRQHandler  ; Digital microphone and DMIC subsystem
                DCD     HW_WAKE_IRQHandler  ; Hardware wake-up
                DCD     HYPERVISOR_IRQHandler  ; Hypervisor
                DCD     SECUREVIOLATION_IRQHandler  ; Secure violation
                DCD     HWVAD0_IRQHandler  ; Hardware Voice Activity Detector
                DCD     Reserved46_IRQHandler  ; Reserved interrupt
                DCD     RNG_IRQHandler  ; Random number Generator
                DCD     RTC_IRQHandler  ; RTC alarm and wake-up
                DCD     DSPWAKE_IRQHandler  ; Wake-up from DSP
                DCD     MU_A_IRQHandler  ; Messaging Unit port A for CM33
                DCD     PIN_INT4_IRQHandler  ; Pin interrupt 4 or pattern match engine slice 4 int
                DCD     PIN_INT5_IRQHandler  ; Pin interrupt 5 or pattern match engine slice 5 int
                DCD     PIN_INT6_IRQHandler  ; Pin interrupt 6 or pattern match engine slice 6 int
                DCD     PIN_INT7_IRQHandler  ; Pin interrupt 7 or pattern match engine slice 7 int
                DCD     CTIMER2_IRQHandler  ; Standard counter/timer CTIMER2
                DCD     CTIMER4_IRQHandler  ; Standard counter/timer CTIMER4
                DCD     OS_EVENT_IRQHandler  ; OS event timer
                DCD     QSPI_IRQHandler  ; Quad/Octal SPI interface
                DCD     Reserved59_IRQHandler  ; Reserved interrupt
                DCD     Reserved60_IRQHandler  ; Reserved interrupt
                DCD     USDHC0_IRQHandler  ; USDHC0 (Enhanced SDHC) interrupt request
                DCD     Reserved62_IRQHandler  ; Reserved interrupt
                DCD     SGPIO_INTA_IRQHandler  ; Secure GPIO interrupt A
                DCD     SGPIO_INTB_IRQHandler  ; Secure GPIO interrupt B
                DCD     I3C_IRQHandler  ; I3C interface 0
                DCD     USB0_IRQHandler  ; High-speed USB device/host
                DCD     USB0_WAKEUP_IRQHandler  ; USB Activity Wake-up Interrupt
                DCD     WDT1_IRQHandler  ; Windowed watchdog timer 1 (HiFi 4 watchdog)
                DCD     USB_PHYDCD_IRQHandler  ; USBPHY DCD
                DCD     DMA1_IRQHandler  ; DMA controller 1 (non-secure or HiFi 4 DMA)
                DCD     PUF_IRQHandler  ; Physical Unclonable Function
                DCD     POWERQUAD_IRQHandler  ; PowerQuad math coprocessor
                DCD     CASPER_IRQHandler  ; Casper cryptographic coprocessor
                DCD     PMC_IRQHandler  ; Power management IC
                DCD     HASHCRYPT_IRQHandler  ; Hash-AES unit

                AREA    |.text|, CODE, READONLY

