JayHeng/imxrt-tool-flash-algo/devices/MIMXRT685S/arm/startup_MIMXRT685S_cm33.s
FLEXCOMM15_IRQHandler\
                PROC
                EXPORT     FLEXCOMM15_IRQHandler        [WEAK]
                LDR        R0, =FLEXCOMM15_DriverIRQHandler
                BX         R0
                ENDP

ADC0_IRQHandler\
                PROC
                EXPORT     ADC0_IRQHandler        [WEAK]
                LDR        R0, =ADC0_DriverIRQHandler
                BX         R0
                ENDP

Reserved39_IRQHandler\
                PROC
                EXPORT     Reserved39_IRQHandler        [WEAK]
                LDR        R0, =Reserved39_DriverIRQHandler
                BX         R0
                ENDP

ACMP_IRQHandler\
                PROC
                EXPORT     ACMP_IRQHandler        [WEAK]
                LDR        R0, =ACMP_DriverIRQHandler
                BX         R0
                ENDP

DMIC0_IRQHandler\
                PROC
                EXPORT     DMIC0_IRQHandler        [WEAK]
                LDR        R0, =DMIC0_DriverIRQHandler
                BX         R0
                ENDP

HW_WAKE_IRQHandler\
                PROC
                EXPORT     HW_WAKE_IRQHandler        [WEAK]
                LDR        R0, =HW_WAKE_DriverIRQHandler
                BX         R0
                ENDP

HYPERVISOR_IRQHandler\
                PROC
                EXPORT     HYPERVISOR_IRQHandler        [WEAK]
                LDR        R0, =HYPERVISOR_DriverIRQHandler
                BX         R0
                ENDP

SECUREVIOLATION_IRQHandler\
                PROC
                EXPORT     SECUREVIOLATION_IRQHandler        [WEAK]
                LDR        R0, =SECUREVIOLATION_DriverIRQHandler
                BX         R0
                ENDP

HWVAD0_IRQHandler\
                PROC
                EXPORT     HWVAD0_IRQHandler        [WEAK]
                LDR        R0, =HWVAD0_DriverIRQHandler
                BX         R0
                ENDP

Reserved46_IRQHandler\
                PROC
                EXPORT     Reserved46_IRQHandler        [WEAK]
                LDR        R0, =Reserved46_DriverIRQHandler
                BX         R0
                ENDP

RNG_IRQHandler\
                PROC
                EXPORT     RNG_IRQHandler        [WEAK]
                LDR        R0, =RNG_DriverIRQHandler
                BX         R0
                ENDP

RTC_IRQHandler\
                PROC
                EXPORT     RTC_IRQHandler        [WEAK]
                LDR        R0, =RTC_DriverIRQHandler
                BX         R0
                ENDP

DSPWAKE_IRQHandler\
                PROC
                EXPORT     DSPWAKE_IRQHandler        [WEAK]
                LDR        R0, =DSPWAKE_DriverIRQHandler
                BX         R0
                ENDP

MU_A_IRQHandler\
                PROC
                EXPORT     MU_A_IRQHandler        [WEAK]
                LDR        R0, =MU_A_DriverIRQHandler
                BX         R0
                ENDP

PIN_INT4_IRQHandler\
                PROC
                EXPORT     PIN_INT4_IRQHandler        [WEAK]
                LDR        R0, =PIN_INT4_DriverIRQHandler
                BX         R0
                ENDP

PIN_INT5_IRQHandler\
                PROC
                EXPORT     PIN_INT5_IRQHandler        [WEAK]
                LDR        R0, =PIN_INT5_DriverIRQHandler
                BX         R0
                ENDP

PIN_INT6_IRQHandler\
                PROC
                EXPORT     PIN_INT6_IRQHandler        [WEAK]
                LDR        R0, =PIN_INT6_DriverIRQHandler
                BX         R0
                ENDP

PIN_INT7_IRQHandler\
                PROC
                EXPORT     PIN_INT7_IRQHandler        [WEAK]
                LDR        R0, =PIN_INT7_DriverIRQHandler
                BX         R0
                ENDP

CTIMER2_IRQHandler\
                PROC
                EXPORT     CTIMER2_IRQHandler        [WEAK]
                LDR        R0, =CTIMER2_DriverIRQHandler
                BX         R0
                ENDP

CTIMER4_IRQHandler\
                PROC
                EXPORT     CTIMER4_IRQHandler        [WEAK]
                LDR        R0, =CTIMER4_DriverIRQHandler
                BX         R0
                ENDP

OS_EVENT_IRQHandler\
                PROC
                EXPORT     OS_EVENT_IRQHandler        [WEAK]
                LDR        R0, =OS_EVENT_DriverIRQHandler
                BX         R0
                ENDP

QSPI_IRQHandler\
                PROC
                EXPORT     QSPI_IRQHandler        [WEAK]
                LDR        R0, =QSPI_DriverIRQHandler
                BX         R0
                ENDP

Reserved59_IRQHandler\
                PROC
                EXPORT     Reserved59_IRQHandler        [WEAK]
                LDR        R0, =Reserved59_DriverIRQHandler
                BX         R0
                ENDP

Reserved60_IRQHandler\
                PROC
                EXPORT     Reserved60_IRQHandler        [WEAK]
                LDR        R0, =Reserved60_DriverIRQHandler
                BX         R0
                ENDP

USDHC0_IRQHandler\
                PROC
                EXPORT     USDHC0_IRQHandler        [WEAK]
                LDR        R0, =USDHC0_DriverIRQHandler
                BX         R0
                ENDP

Reserved62_IRQHandler\
                PROC
                EXPORT     Reserved62_IRQHandler        [WEAK]
                LDR        R0, =Reserved62_DriverIRQHandler
                BX         R0
                ENDP

SGPIO_INTA_IRQHandler\
                PROC
                EXPORT     SGPIO_INTA_IRQHandler        [WEAK]
                LDR        R0, =SGPIO_INTA_DriverIRQHandler
                BX         R0
                ENDP

SGPIO_INTB_IRQHandler\
                PROC
                EXPORT     SGPIO_INTB_IRQHandler        [WEAK]
                LDR        R0, =SGPIO_INTB_DriverIRQHandler
                BX         R0
                ENDP

I3C_IRQHandler\
                PROC
                EXPORT     I3C_IRQHandler        [WEAK]
                LDR        R0, =I3C_DriverIRQHandler
                BX         R0
                ENDP

USB0_IRQHandler\
                PROC
                EXPORT     USB0_IRQHandler        [WEAK]
                LDR        R0, =USB0_DriverIRQHandler
                BX         R0
                ENDP

USB0_WAKEUP_IRQHandler\
                PROC
                EXPORT     USB0_WAKEUP_IRQHandler        [WEAK]
                LDR        R0, =USB0_WAKEUP_DriverIRQHandler
                BX         R0
                ENDP

